{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "180"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "180"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "180"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_5/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_5/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_6/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_6/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_7/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_7/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_8/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_8/dense_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_9/dense_9/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "180"}]}}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_9/dense_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "180"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "180"}]}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/BiasAdd", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/Sigmoid", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/Sigmoid", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/Sigmoid", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/Sigmoid", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_5/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/Sigmoid", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_5/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_5/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_6/dense_6/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_5/dense_5/BiasAdd", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_6/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_6/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_7/dense_7/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_6/dense_6/BiasAdd", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_7/dense_7/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_7/dense_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_8/dense_8/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_7/dense_7/BiasAdd", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_8/dense_8/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_8/dense_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_9/dense_9/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_8/dense_8/BiasAdd", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_9/dense_9/MatMul/ReadVariableOp", "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_9/dense_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_9/dense_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/MatMul/ReadVariableOp", "shape": [180, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper/dense/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/MatMul/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_1/dense_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/MatMul/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_2/dense_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/MatMul/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_3/dense_3/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/MatMul/ReadVariableOp", "shape": [16, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential/module_wrapper_4/dense_4/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_5/dense_5/MatMul/ReadVariableOp", "shape": [8, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_5/dense_5/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_6/dense_6/MatMul/ReadVariableOp", "shape": [16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_6/dense_6/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_7/dense_7/MatMul/ReadVariableOp", "shape": [32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_7/dense_7/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_8/dense_8/MatMul/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_8/dense_8/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_9/dense_9/MatMul/ReadVariableOp", "shape": [128, 180], "dtype": "float32"}, {"name": "StatefulPartitionedCall/anomaly_detector/sequential_1/module_wrapper_9/dense_9/BiasAdd/ReadVariableOp", "shape": [180], "dtype": "float32"}]}]}